backend/app/controllers/addresses_controller.rb

SELECT "addresses"."city", "addresses"."district", "addresses"."town", "addresses"."description", "addresses"."price", "addresses"."phone_number", "addresses"."id" FROM "addresses" WHERE "addresses"."user_id" = $1  [["user_id", 1]]
---
  def show
    address  = @user.addresses.select(:city, :district, :town, :description, :price, :phone_number, :id)

INSERT INTO "addresses" ("city", "district", "town", "description", "price", "phone_number", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    new_address = @user.addresses.create(
      user_id: @user.id,
      city: params[:city],
      town: params[:town],
      district: params[:district],
      description: params[:description],
      price: params[:price],
      phone_number: params[:phone_number]
    )

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_address
    @user = User.find_by(id: params[:id])