backend/app/controllers/orders_controller.rb

  def show
    user_id = params[:id] != nil ? params[:id] : nil
    status = params[:status] != nil ? params[:status] : nil

    if user_id != nil
      email = User.find_by(id: user_id).email
      orders_of_user = Order.where(user_id: user_id)
      if status != nil
        orders_of_user = orders_of_user.where(status: status)
        render json: {
            email: email,
            orders: orders_of_user,
            status: status,
            total: orders_of_user.length
        }
      else # render all orders (all status)
        render json: {
            email: email,
            orders: orders_of_user,
            status: "all",
            total: orders_of_user.length
        }
      end
    else # render all orders
      all_order = Order.all
      render json: {
          code: 0,
          all_order: all_order,
          total: all_order.length
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"

  def update
    if params[:id] == nil
      render json: {
          code: 1,
          message: "Missing id of product"
      }
      return
    end
    order = Order.find_by(id: params[:id])
    if order.update(status: params[:status])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", nil], ["updated_at", "2022-04-24 10:03:29.196262"], ["id", 15]]

  def create

    new_order = Order.create(set_params.merge({user_id: params[:user_id]}))
    # array of id
    products = params[:products].map do |product|
                 Product.find_by(id: product)
               end
    email = User.find_by(id: params[:user_id]).email
    new_order.products << products
---
INSERT INTO "orders" ("user_id", "status", "total_price", "description", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    user_id = params[:id] != nil ? params[:id] : nil
    status = params[:status] != nil ? params[:status] : nil

    if user_id != nil
      email = User.find_by(id: user_id).email
      orders_of_user = Order.where(user_id: user_id)
      if status != nil
        orders_of_user = orders_of_user.where(status: status)
        render json: {
            email: email,
            orders: orders_of_user,
            status: status,
            total: orders_of_user.length
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

  def update
    if params[:id] == nil
      render json: {
          code: 1,
          message: "Missing id of product"
      }
      return
    end
    order = Order.find_by(id: params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

  def create

    new_order = Order.create(set_params.merge({user_id: params[:user_id]}))
    # array of id
    # quantity
    products = params[:products].map do |product|
                 Product.find_by(id: product)
               end
    email = User.find_by(id: params[:user_id]).email
    new_order.products << products

    # update quantity
    OrdersProduct.where(order_id: new_order.id).each_with_index.map do |product, index|
---
SELECT "orders_products".* FROM "orders_products" WHERE "orders_products"."order_id" = $1  [["order_id", 15]]
SELECT "products".* FROM "products" INNER JOIN "orders_products" ON "products"."id" = "orders_products"."product_id" WHERE "orders_products"."order_id" = $1  [["order_id", 15]]