backend/app/controllers/orders_controller.rb

  def show
    product_id = @order.orders_products.pluck(:product_id, :quantity, :size, :color).map do |information|
      {
        product_id: information[0],
        name: Product.find_by(id: information[0]).name,
        price: Product.find_by(id: information[0]).price,
        image: Product.find_by(id: information[0]).image ? Product.find_by(id: information[0]).image[0] : nil ,
        quantity: information[1],
        size: information[2],
        color: information[3]
---
SELECT "orders_products"."product_id", "orders_products"."quantity", "orders_products"."size", "orders_products"."color" FROM "orders_products" WHERE "orders_products"."order_id" = $1  [["order_id", 16]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # handle valid quantity, size, color
    unless params[:quantity].length == params[:size].length && params[:quantity].length == params[:color].length \
      && (params[:quantity].all? { |number|
        number > 0
      })
      render json: {
        code: 1,
        message: "Invalid quantity or size or color!"
      }
      return
    end

    if params[:products].length != params[:quantity].length
      render json: {
        code: 1,
        message: "Product providing is deficient or redundant!"
      }
      return
    end

    new_order = Order.create(set_params.merge({user_id: params[:id]}))

    # array of id
    # quantity
    products = params[:products].map do |product|
                  Product.find_by(id: product)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]



    # update quantity, size, color
    OrdersProduct.where(order_id: new_order.id).each_with_index.map do |product, index|
---
SELECT "orders_products".* FROM "orders_products" WHERE "orders_products"."order_id" = $1  [["order_id", 26]]

  def set_order
    @order = Order.find_by(id: params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]