backend/app/controllers/orders_controller.rb

  def create

    new_order = Order.create(set_params.merge({user_id: params[:user_id]}))
    # array of id
    # quantity
    products = params[:products].map do |product|
                 Product.find_by(id: product)
               end
    email = User.find_by(id: params[:user_id]).email
    new_order.products << products

    # update quantity
    OrdersProduct.where(order_id: new_order.id).each_with_index.map do |product, index|
---
SELECT "products".* FROM "products" INNER JOIN "orders_products" ON "products"."id" = "orders_products"."product_id" WHERE "orders_products"."order_id" = $1  [["order_id", 15]]
SELECT "orders_products".* FROM "orders_products" WHERE "orders_products"."order_id" = $1  [["order_id", 15]]