backend/app/controllers/products_controller.rb

  def show_ratings
    type = params[:type] ? params[:type] : "all"

    ratings = Rating.where(product_id: @product.id)

    ratings = ratings.where(category: type) if type != "all"

    render json: {
        code: 0,
        ratings: ratings,
        total: ratings.length
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."product_id" = $1 AND "ratings"."category" = $2  [["product_id", 1], ["category", "5 Stars"]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."product_id" = $1  [["product_id", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."product_id" = $1 AND "ratings"."category" = $2  [["product_id", 5], ["category", "media"]]

  def set_product
    @product = Product.find_by(id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]