backend/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "image", "description", "price", "third_party", "color", "size", "overview", "category", "created_at", "updated_at", "custom_design", "avg_star") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    new_product = Product.new(product_params)
    if new_product.save

UPDATE "products" SET "category" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["category", "chair"], ["updated_at", "2022-04-27 03:08:44.857096"], ["id", 20]]
---
  def update
    @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 20]]
---
  def destroy
    @product.destroy

SELECT COUNT(*) FROM "products" WHERE "products"."category" = $1  [["category", "bed"]]
SELECT "products"."id", "products"."name", "products"."image", "products"."price" FROM "products" WHERE "products"."category" = $1  [["category", "bed"]]
SELECT COUNT(*) FROM "products"
SELECT "products"."id", "products"."name", "products"."image", "products"."price" FROM "products"
---
  def display_product
    type = params[:type] ? params[:type] : "all"
    page = params[:page] ? params[:page].to_i : 0
    limit = params[:limit] ? params[:limit].to_i : 0
    name = params[:name] ? params[:limit].to_i : ""
    total = 0

    if name != ""
      search
    else

      if type != "all"
        total = Product.where(category: type).count
        @products = page == 0 ? Product.where(category: type).select(:id, :name, :image, :price, :category) : \
        Product.where(category: type).select(:id, :name, :image, :price, :category).limit(limit).offset((page-1)*limit)
      else
        total = Product.count
        @products = page == 0 ? Product.select(:id, :name, :image, :price, :category) : \
        Product.select(:id, :name, :image, :price, :category).limit(limit).offset((page-1)*limit)

SELECT "ratings".* FROM "ratings" WHERE "ratings"."product_id" = $1  [["product_id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."product_id" = $1  [["product_id", 21]]
---
  def show_ratings
    type = params[:type] ? params[:type] : "all"
    ratings = Rating.where(product_id: @product.id)

    # select the type given
    ratings = ratings.select do |rating|
      rating[:category] != nil && (rating[:category].include? type)
    end if type != "all"

    # update name in ratings
    # name = ""
    ratings = ratings.as_json.each do |rating|
      name = User.find_by(id: rating["user_id"]).name
      rating["name"] = name
      # puts User.find_by(id: rating[:user_id]).email
    end

    render json: {
        code: 0,
        ratings: ratings,
        total: ratings.length

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ltt@gmail.com"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."product_id" = $1  [["product_id", 5]]
UPDATE "products" SET "updated_at" = $1, "avg_star" = $2 WHERE "products"."id" = $3  [["updated_at", "2022-04-28 10:10:21.720095"], ["avg_star", 4.8], ["id", 5]]
INSERT INTO "ratings" ("user_id", "product_id", "description", "image", "category", "star", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create_ratings
    user = User.find_by(email: params[:email])
    #product = Product.find_by(id: params[:id])
    # modify the average stars.
    all_ratings = product.ratings.count
    new_avg_star = (product.avg_star * all_ratings + params[:star])/(all_ratings + 1)
    product.update(avg_star: new_avg_star)
    product.save

SELECT "ratings".* FROM "ratings" WHERE "ratings"."product_id" = $1 AND "ratings"."id" = $2 LIMIT $3  [["product_id", 5], ["id", 17], ["LIMIT", 1]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."product_id" = $1  [["product_id", 5]]
UPDATE "products" SET "updated_at" = $1, "avg_star" = $2 WHERE "products"."id" = $3  [["updated_at", "2022-04-28 10:12:21.586612"], ["avg_star", 4.4], ["id", 5]]
DELETE FROM "ratings" WHERE "ratings"."id" = $1  [["id", 17]]
---
  def destroy_ratings
    del_rating = @product.ratings.find_by(id: params[:rating_id])
    #update avg_star
    all_ratings = @product.ratings.count
    new_avg_star = all_ratings > 1 ? (@product.avg_star * all_ratings - del_rating.star)/(all_ratings - 1) : 0.0
    @product.update(avg_star: new_avg_star)
    @product.save

    if del_rating.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find_by(id: params[:id])