backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mdclondg@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "ltt@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-04-28 08:51:10.154928"], ["updated_at", "2022-04-28 08:51:10.154928"], ["name", "TTL"]]
---
  def create
    user = User.find_by(email: user_params[:email])
    if user != nil
      render json: {
          code: 1,
          message: "Invalid email or password!"
      }
    else
      @user = User.create(user_params)

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
SELECT "orders"."id", "orders"."status", "orders"."total_price", "orders"."description", "orders"."address" FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."status" IN ($2, $3)  [["user_id", 3], ["status", "Shipped"], ["status", "Evaluated"]]
SELECT "orders"."id", "orders"."status", "orders"."total_price", "orders"."description", "orders"."address" FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."status" = $2  [["user_id", 1], ["status", "cancel"]]
---
  def show_order
    @orders = Order.where(user_id: params[:id])
    @orders = @orders.where(status: params[:status]) if params[:status] != nil
    @orders = @orders.select(:id, :status, :total_price, :description, :address)
    total = @orders.length